<template>
  <full-page :options="options">
    <project-section/>
    <welcome-section/>
    <contributor-section/>
    <footer-section/>
  </full-page>
</template>

<script>
import WelcomeSection from "./WelcomeSection";
import ProjectSection from "./ProjectSection";
import ContributorSection from "./ContributorSection"
import FooterSection from "./FooterSection";

export default {
  components: {
    WelcomeSection,
    ProjectSection,
    ContributorSection,
    FooterSection
  },

  data: () => ({
    options: {
      licenseKey: 'YOUR_KEY_HERE',
      controlArrows: true,
      menu: "#menu",
      anchors: ["Welcome", "Product", "Contributor", "Footer"],
      sectionsColor: ["#000000", "#000000", "#FFFFFF","#FFFFFF"],
      lockAnchors: true,
      scrollBar: false,
      fitToSection: true,
      navigation: true,
      navigationPosition: 'right',
      navigationTooltips: ["Welcome", "Product", "Contributor", "Footer"],
    },
  }),

  beforeCreate() {
    console.log('나는 개발왕이 될 루피다.')
    console.log('내 동료가 돼라 !')
    console.log('Welcome to Milzipmoza Developers')
    console.log(`
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@&&&@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@,.(((((((((((((.,@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@ ((((((((((((((((((((( @@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@ (( (((((((((((((((((((((( @@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@&(((/(.(/(((((((((((((((((( ((%@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@%((((((((((((((((((((((((((((.((#@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,&@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@ ********************************* @@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@***********************************@@@@@@@@@@@@@@@@
@@@@@ (((((((((((((((((((((((((((((((((((((((((((((((((((((((((((.@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@        @@/,     ,*@@        @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@        *@   , ,  .@/        @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@            .% %,            @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@                             @@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@/////// ///////////////// ///////@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@/@@@@@@@@@@@@@@@@@@@,@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@@@@@@@/@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@&&&&&&&&&&&&&&&&&&&&&&&@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    `)
  }
}
</script>

<style>

.container {
  min-height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
  text-align: center;
}

.title {
  font-family: "Quicksand", "Source Sans Pro", -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, "Helvetica Neue", Arial, sans-serif; /* 1 */
  display: block;
  font-weight: 300;
  font-size: 100px;
  color: #35495e;
  letter-spacing: 1px;
}

.subtitle {
  font-weight: 300;
  font-size: 42px;
  color: #526488;
  word-spacing: 5px;
  padding-bottom: 15px;
}

.links {
  padding-top: 15px;
}
</style>

